{
  "hi": "👋 Hello,  welcome to **Excel Engineering College**! I'm your virtual assistant here to help you with everything related to **admissions, courses, fees, hostel facilities, placements**, and more. Just type your question to get started — I'm here to assist you anytime! 😊",
  "admission": "Admissions are open for 2025. Visit our website or contact the admissions office for details on eligibility and application process. website: https://excelinstitutions.com/excel_engg/ or call +91-4288-123456.",
  "fee": "Course fees range from Rs. 80,000 to Rs. 1,25,000 per year depending on the program; hostel and transport charges are additional. For detailed fee structure, please contact the admission cell or visit Excel Engineering College campus.",
  "admission_process": "The admission process includes filling out the online application form, submitting required documents, and attending counseling sessions. For B.Tech, TNEA counseling is conducted based on 12th standard marks.",
  "highlights": "Excel Engineering College is affiliated with Anna University and offers a wide range of undergraduate and postgraduate programs. The college is known for its excellent faculty, state-of-the-art infrastructure, and strong placement record. It has been awarded 'Best Emerging Engineering College' by the Tamil Nadu Government.",
  "location": "Excel Engineering College is located in Komarapalayam, Namakkal district, Tamil Nadu, India. It is easily accessible by road and rail, with nearby bus and train stations.",
  "established": "Excel Engineering College was established in 2008 and has since grown to become one of the leading engineering institutions in Tamil Nadu.",
  "course": [
    "B.Tech in Computer Science",
    "B.Tech in Electronics and Communication",
    "B.Tech in Mechanical Engineering",
    "B.Tech in Civil Engineering",
    "B.Tech in Electrical and Electronics Engineering",
    "B.Tech in Information Technology",
    "B.Sc in Computer Science",
    "B.Sc in Mathematics",
    "B.Sc in Physics",
    "B.Sc in Chemistry",
    "B.Com (Bachelor of Commerce)",
    "B.A (Bachelor of Arts)",
    "BBA (Bachelor of Business Administration)",
    "BCA (Bachelor of Computer Applications)",
    "B.Pharm (Bachelor of Pharmacy)",
    "MBBS (Bachelor of Medicine and Bachelor of Surgery)",
    "BDS (Bachelor of Dental Surgery)",
    "BE in Aeronautical Engineering",
    "BE in Electronics and Instrumentation",
    "BE in Robotics and Automation",
    "M.Tech in Computer Science",
    "M.Tech in Data Science",
    "M.Tech in VLSI Design",
    "M.Tech in Mechanical Engineering",
    "MBA (Master of Business Administration)",
    "MCA (Master of Computer Applications)",
    "M.Sc in Physics",
    "M.Sc in Chemistry",
    "M.Com (Master of Commerce)",
    "MA (Master of Arts)",
    "Diploma in Mechanical Engineering",
    "Diploma in Civil Engineering",
    "Diploma in Electrical Engineering",
    "Polytechnic in Electronics",
    "Ph.D in Computer Science",
    "Ph.D in Management Studies",
    "B.Ed (Bachelor of Education)",
    "M.Ed (Master of Education)",
    "D.Pharm (Diploma in Pharmacy)",
    "GNM (General Nursing and Midwifery)",
    "ANM (Auxiliary Nursing and Midwifery)",
    "....more details available on the college website......  https://excelinstitutions.com/excel_engg/"
  ],
  "hostel": "Excel Engineering College provides separate hostels for boys and girls with modern facilities. The hostel offers spacious and well-ventilated rooms, 24/7 security, high-speed Wi-Fi, attached bathrooms, purified drinking water, study halls, recreation rooms, and a hygienic mess with vegetarian and non-vegetarian food options. Laundry services and medical assistance are also available. Hostel fees are Rs. 40,000 per year.",
  "placement": "Over 90% placement record. Top recruiters include DataPattern.ai, TCS, Infosys, Wipro, and HCL.",
  "contact": {
    "address": "Excel Engineering College, Komarapalayam, Namakkal, Tamil Nadu, India",
    "phone": "+91-4288-123456",
    "email": "admissions@excelenggcollege.com"
  }
}
